[
    {
        "data": 1174,
        "questions": [
            "1. Bộ Học được thành lập vào năm nào và dưới triều đại nào?",
            "2. Ai là người được cấp văn bằng từ Bộ Quốc dân giáo dục theo đoạn văn?",
            "3. Những thay đổi nào xảy ra với các bộ của triều Nguyễn trong giai đoạn 1902-1906?",
            "4. Văn bản từ Bộ Học được viết bằng ngôn ngữ nào và có kích thước bao nhiêu?",
            "5. Ai là Thượng thư đầu tiên của Bộ Quốc dân giáo dục sau khi Bộ Học được đổi tên?"
        ]
    },
    {
        "data": 444,
        "questions": [
            "1. Tại sao Báo chí Việt Nam phát triển từ cuối thế kỉ XIX?",
            "2. Ai là chủ bút của tờ Gia Định báo và khi nào tờ báo này ra mắt?",
            "3. Những tờ báo nào đã tồn tại lâu nhất trong thời kỳ đầu của báo chí Hà Nội?",
            "4. Ai là những cây bút nổi bật trong các tờ báo đầu tiên bằng chữ quốc ngữ?",
            "5. Báo chí Hà Nội trong giai đoạn nào đã chứng kiến sự cấm đoán của chính quyền thực dân Pháp?"
        ]
    },
    {
        "data": 1572,
        "questions": [
            "1. Lý Huệ Tông đã phải đối mặt những khó khăn nào trong cuộc đời của mình?",
            "2. Ai là người đã ép Lý Huệ Tông nhường ngôi và bắt ông đi tu?",
            "3. Những biến cố nào đã dẫn đến thảm cảnh của Lý Huệ Tông trong triều đại?",
            "4. Lý Huệ Tông mắc bệnh gì và các triệu chứng của nó như thế nào?",
            "5. Tại sao Lý Huệ Tông lại bị bức tử và ai là người đứng sau quyết định này?"
        ]
    },
    {
        "data": 1483,
        "questions": [
            "1. Bảo tàng Hải dương học Nha Trang được thành lập vào năm nào và bởi ai?",
            "2. Những đặc điểm gì của Bảo tàng Hải dương học làm nổi bật giá trị nghiên cứu hải dương tại Việt Nam?",
            "3. Bảo tàng Hải dương học Nha Trang có bao nhiêu mẫu vật và bao nhiêu loài sinh vật biển?",
            "4. Những loài cá nào được nhắc đến trong đoạn văn và đặc điểm nổi bật của chúng là gì?",
            "5. Mô hình tàu “De Lanessan” đã thực hiện những hành trình khảo sát nào trong giai đoạn nào?"
        ]
    },
    {
        "data": 1050,
        "questions": [
            "1. Ai là nhân vật chính trong truyền thuyết Thánh Gióng và vai trò của nhân vật này là gì?",
            "2. Theo Ngọc phả Hùng Vương, vua đã ra lệnh rèn bao nhiêu sắt để làm ngựa và vũ khí cho Thánh Gióng?",
            "3. Có những chi tiết nào khác nhau giữa các văn bản ghi chép về trận chiến của Thánh Gióng với giặc Ân?",
            "4. Tại sao chi tiết Thánh Gióng cưỡi ngựa bay lên trời lại được ghi chép tương đối giống nhau trong nhiều tài liệu khác nhau?",
            "5. Ý nghĩa của việc ghi chép khác nhau trong các văn bản về Thánh Gióng đối với việc hiểu biết văn hóa và lịch sử dân tộc là gì?"
        ]
    },
    {
        "data": 367,
        "questions": [
            "1. Những sự kiện quan trọng nào đã xảy ra trong tháng 7 liên quan đến triều Nguyễn theo đoạn văn?",
            "2. Tại sao tháng 7 lại được coi là tháng biến động trong lịch sử triều Nguyễn?",
            "3. Ai là các nhân vật nổi bật trong phong trào Cần Vương và họ đã làm gì vào tháng 7 năm 1885?",
            "4. Cuộc tấn công của Pháp vào Việt Nam bắt đầu vào ngày nào và có ý nghĩa gì đối với triều Nguyễn?",
            "5. Sự chuyển giao quyền hành từ triều đình nhà Nguyễn sang thực dân Pháp diễn ra vào thời điểm nào và ảnh hưởng của nó là gì?"
        ]
    },
    {
        "data": 612,
        "questions": [
            "1. Thành Nhà Hồ được xây dựng vào năm nào và ai là người đứng sau công trình này?",
            "2. Đôi rồng đá cụt đầu có chiều dài bao nhiêu và đặc điểm chạm khắc của nó ra sao?",
            "3. Có những giả thuyết nào về nguyên nhân mất đầu của đôi rồng đá tại thành Nhà Hồ?",
            "4. Ngôi mộ táng khổng lồ được phát hiện ở đâu và bộ xương của động vật nào đã được tìm thấy bên trong?",
            "5. Nàng Bình Khương có vai trò gì trong câu chuyện lịch sử liên quan đến việc xây dựng thành Nhà Hồ?"
        ]
    },
    {
        "data": 342,
        "questions": [
            "1. Ai là người có công lớn trong chiến dịch Sa Thầy và đã viết hồi ký về quá trình chuẩn bị chiến dịch này?",
            "2. Khu vực tác chiến của chiến dịch Sa Thầy được xác định là bao nhiêu km2 và nằm ở đâu?",
            "3. Các lực lượng tham gia chiến dịch đã sử dụng những chiến thuật nào để dụ địch vào bẫy?",
            "4. Những thiệt hại mà quân Mỹ phải gánh chịu trong chiến dịch Sa Thầy là gì?",
            "5. Chiến dịch Sa Thầy đã thể hiện điều gì về tài thao lược của tướng lĩnh Quân đội Nhân dân Việt Nam?"
        ]
    },
    {
        "data": 1938,
        "questions": [
            "1. Lý Thái Tổ đã dời đô từ đâu đến đâu trong hành trình của ông?",
            "2. Những địa danh nào quan trọng được đề cập trong con đường dời đô của vua Lý Thái Tổ?",
            "3. Có những ý kiến khác nhau gì về đoạn đường thủy mà vua Lý Thái Tổ đã chọn?",
            "4. Tại sao bến Đền được xem là điểm khởi đầu cho hành trình dời đô của triều đình nhà Lý?",
            "5. Những nghi lễ hay sự kiện nào đã diễn ra tại các địa điểm mà vua Lý Thái Tổ đi qua trong hành trình dời đô?"
        ]
    },
    {
        "data": 924,
        "questions": [
            "1. Ai là người khởi công xây dựng lăng mộ Quốc Công Phạm Đăng Hưng?",
            "2. Tấm bia đá đã trải qua bao nhiêu năm lưu lạc trước khi về Gò Công?",
            "3. Những sự kiện nào đã xảy ra liên quan đến viên sĩ quan Pháp Barbé?",
            "4. Vị trí địa lý của lăng mộ Hoàng Gia có ý nghĩa gì đối với lịch sử?",
            "5. Tại sao tấm bia đá lại trở thành một phần trong câu chuyện về viên sĩ quan Barbé?"
        ]
    },
    {
        "data": 1484,
        "questions": [
            "1. Thành phố Petra được gọi là gì và vì sao nó lại có cái tên này?",
            "2. Ai là người đầu tiên khám phá Petra sau hơn 600 năm và vào năm nào?",
            "3. Những đặc điểm kiến trúc nổi bật nào mà Petra sở hữu?",
            "4. Người Nabataeans đã làm gì để phát triển thành phố Petra trong quá khứ?",
            "5. Những yếu tố nào khiến Petra trở thành một điểm đến du lịch thu hút được nhiều du khách hàng năm?"
        ]
    },
    {
        "data": 1380,
        "questions": [
            "1. Ai là tác giả của câu nói “Ta thà làm quỷ nước Nam, còn hơn làm vương đất Bắc” và bối cảnh ra đời của nó là gì?",
            "2. Triệu Thị Trinh (Bà Triệu) đã lãnh đạo cuộc khởi nghĩa chống xâm lược vào năm nào?",
            "3. Câu nói phản ánh tâm tư của Hồ Nguyên Trừng trong cuộc kháng chiến chống quân Minh là gì?",
            "4. Bùi Thị Xuân đã thể hiện tinh thần kiên cường như thế nào trước quyết định xử án của Nguyễn Phúc Ánh?",
            "5. Nguyễn Trung Trực đã có những chiến công nổi bật nào trong cuộc kháng chiến chống thực dân Pháp?"
        ]
    },
    {
        "data": 1715,
        "questions": [
            "1. Mèo đã được thuần hóa từ bao giờ theo các tài liệu lịch sử?",
            "2. Ở Nhật Bản, mèo được coi là biểu tượng của điều gì?",
            "3. Thần Vidali ở Ấn Độ có mối liên hệ nào với mèo?",
            "4. Tại sao mèo lại được tôn thờ ở Ai Cập cổ đại?",
            "5. Ý nghĩa của mèo trong văn hóa dân gian Việt Nam là gì?"
        ]
    },
    {
        "data": 1978,
        "questions": [
            "1. Chùa Hoằng Phúc còn có những tên gọi nào khác ngoài tên hiện tại?",
            "2. Ai là tác giả viết về di tích chùa Hoằng Phúc trong sách \"Ô châu cận lụcc\"?",
            "3. Chùa Hoằng Phúc đã tồn tại bao nhiêu năm và có ý nghĩa gì đối với lịch sử Quảng Bình?",
            "4. Những sự kiện lịch sử nào đã gắn liền với chùa Hoằng Phúc trong các thời kỳ khác nhau?",
            "5. Các hiện vật giá trị nào hiện vẫn được lưu giữ tại chùa Hoằng Phúc sau chiến tranh?"
        ]
    },
    {
        "data": 94,
        "questions": [
            "1. Nội dung chính của họa bản báo Việt Nam độc lập số 102 là gì?",
            "2. Tại sao sự hợp tác giữa Việt Minh và Mỹ lại được hình thành trong Cách mạng tháng Tám 1945?",
            "3. Những khó khăn nào mà chính phủ Việt Nam Dân chủ Cộng hòa phải đối mặt sau khi tuyên bố độc lập?",
            "4. Hồ Chí Minh đã thực hiện những biện pháp ngoại giao nào để tìm kiếm sự hỗ trợ từ Mỹ?",
            "5. Những yếu tố nào đã dẫn đến sự tan vỡ trong mối quan hệ hợp tác giữa Việt Nam và Mỹ sau Cách mạng tháng Tám?"
        ]
    },
    {
        "data": 487,
        "questions": [
            "1. Ai là những họa sĩ tham gia vào tập ký họa \"Miền Nam Việt Nam - đất nước, con người\" năm 1967?",
            "2. Tập ký họa này có bao nhiêu phần và nội dung chính của phần 2 là gì?",
            "3. Những nhân vật nào được giới thiệu trong chủ đề chân dung các má, các chị?",
            "4. Có những chủ đề nào khác ngoài chân dung các má, các chị trong những tập ký họa này?",
            "5. Ai là tác giả của các bức tranh và năm nào chúng được sáng tác trong chủ đề chân dung?"
        ]
    },
    {
        "data": 640,
        "questions": [
            "1. Ai là người chỉ huy chính trong chiến dịch \"Điện Biên Phủ trên không\" năm 1972?",
            "2. Những biện pháp nào được Đại tướng Võ Nguyên Giáp và Bộ Tư lệnh Quân chủng phòng không thực hiện để đối phó với máy bay B.52?",
            "3. Sự kiện nào đã diễn ra vào ngày 18-12-1972 và đây là thời điểm nào trong chiến dịch?",
            "4. Những khó khăn nào mà quân dân Hà Nội đã phải đối mặt trong chiến dịch \"Điện Biên Phủ trên không\"?",
            "5. Tầm quan trọng của chiến thắng \"Điện Biên Phủ trên không\" đối với cuộc chiến tranh Việt Nam là gì?"
        ]
    },
    {
        "data": 1264,
        "questions": [
            "1. Bảo tàng nào ở Toronto được biết đến với thiết kế giống như một con tàu vũ trụ?",
            "2. Kiến trúc sư nào đã thiết kế bảo tàng Guggenheim Bilbao tại Tây Ban Nha?",
            "3. Tại sao bảo tàng nghệ thuật quốc gia Osaka được so sánh với một con côn trùng?",
            "4. Bảo tàng nào được coi là lớn nhất Canada và đứng thứ năm ở Bắc Mỹ?",
            "5. Viện Bảo tàng Nghệ thuật Hiện đại Trung Đông ở Dubai tượng trưng cho điều gì trong văn hóa Ả Rập?"
        ]
    },
    {
        "data": 1402,
        "questions": [
            "1. Chùa Bà Ngô gắn liền với sự kiện nào trong lịch sử phong kiến Việt Nam?",
            "2. Nguyên phi Ỷ Lan có vai trò gì trong việc xây dựng chùa Bà Tấm?",
            "3. Ai đã có công xây dựng chùa Bà Già và nguyên nhân vì sao ngôi chùa mang tên đó?",
            "4. Chùa Bà Đá có những đặc điểm nổi bật nào về kiến trúc và lịch sử?",
            "5. Vào năm nào, Chủ tịch Hồ Chí Minh đã thăm chùa Bà Đá và bàn về vấn đề gì với tăng ni, phật tử?"
        ]
    },
    {
        "data": 854,
        "questions": [
            "1. Ai là Trạng nguyên nổi tiếng với bài văn về kế sách trị nước trong lịch sử Việt Nam?",
            "2. Nội dung chính của bài \"Đối đình sách\" của Vũ Kiệt là gì?",
            "3. Tại sao Vũ Kiệt lại quyết định từ bỏ con đường quan lộ để xuất gia tu hành?",
            "4. Câu đối giữa Vũ Kiệt và cô gái làng Mèn thể hiện điều gì về văn hóa dân gian Việt Nam?",
            "5. Vũ Kiệt đã đóng góp gì cho triều đình sau khi hoàn tục và kết thúc cuộc sống tu hành của mình?"
        ]
    },
    {
        "data": 780,
        "questions": [
            "1. Ai là người mở đầu quá trình khai phá Mô Xoài và vào năm nào?",
            "2. Vai trò của vùng Mô Xoài trong tiến trình mở cõi về Nam Bộ là gì?",
            "3. Tại sao Mô Xoài được xem là lựa chọn tối ưu của chúa Nguyễn trong việc mở rộng lãnh thổ?",
            "4. Những lý do nào đã dẫn đến việc người Việt chọn Mô Xoài làm nơi định cư đầu tiên?",
            "5. Tâm thức “núi - sông” của cư dân Việt đã ảnh hưởng như thế nào đến việc định cư tại Mô Xoài?"
        ]
    },
    {
        "data": 83,
        "questions": [
            "1. Ai là người đã cho đúc những đồng tiền thưởng đầu tiên trong triều Nguyễn?",
            "2. Những đồng tiền thưởng thời Minh Mệnh thường mang thông điệp gì?",
            "3. Điều gì đặc biệt về đồng tiền thưởng khắc thơ thời vua Thành Thái?",
            "4. Tại sao các đồng tiền thưởng được coi là có giá trị cao hơn tiền nhỏ?",
            "5. Số lượng và loại tiền thưởng có sự thay đổi như thế nào qua các triều đại?"
        ]
    },
    {
        "data": 739,
        "questions": [
            "1. \"Hội nghị Bình Than\" của nhà Hồ diễn ra vào năm nào và có mục đích gì?",
            "2. Ai là người khuyên nhà Hồ nên tạm hòa với quân Minh và vì sao?",
            "3. Ai là kẻ đưa ra cáo buộc với vua Minh về việc tiếm ngôi của nhà Hồ?",
            "4. Sau khi quân Minh tấn công nước ta, ai đã nghĩ ra kế hoạch giải cứu Thiêm Bình?",
            "5. Những khó khăn gì mà quân Hồ gặp phải trong cuộc chiến chống lại quân Minh?"
        ]
    },
    {
        "data": 302,
        "questions": [
            "1. Cách mạng tháng Mười Nga ảnh hưởng như thế nào đến phong trào cách mạng ở Việt Nam vào năm 1929?",
            "2. Những hoạt động kỷ niệm Cách mạng tháng Mười Nga tại Việt Nam được tổ chức ở những vùng nào?",
            "3. Nội dung của các tờ truyền đơn kỷ niệm Cách mạng tháng Mười Nga bao gồm những thông điệp gì?",
            "4. Ai là những nhân vật chính trong việc truyền bá tư tưởng cách mạng tháng Mười Nga tại Nam Kỳ?",
            "5. Vì sao những người cộng sản Việt Nam tiếp tục kỷ niệm Cách mạng tháng Mười Nga trong các nhà tù của thực dân Pháp?"
        ]
    },
    {
        "data": 1658,
        "questions": [
            "1. Những bức tượng nổi tiếng nào làm tốn giấy mực của báo chí từ xưa đến nay?",
            "2. Tượng Little Mermaid có kích thước và trọng lượng như thế nào?",
            "3. Bức tượng Mother Russia được xây dựng để tưởng niệm sự kiện lịch sử nào?",
            "4. Hòn đảo nào nằm nơi có tượng Lions of Delos và nó có ý nghĩa gì?",
            "5. Ai là người điêu khắc tượng David và bức tượng này có chiều cao là bao nhiêu?"
        ]
    },
    {
        "data": 353,
        "questions": [
            "1. Việt Nam đã có những thay đổi gì trong cơ cấu kinh tế sau 30 năm đổi mới?",
            "2. Các yếu tố nào đã góp phần vào sự tăng trưởng GDP bình quân của Việt Nam trong giai đoạn 1991-2015?",
            "3. Lợi ích từ việc ký kết các Hiệp định thương mại tự do có ảnh hưởng như thế nào đến nền kinh tế Việt Nam?",
            "4. Những thách thức nào mà nền kinh tế Việt Nam vẫn đang phải đối mặt sau 30 năm đổi mới?",
            "5. Sự chuyển dịch cơ cấu lao động ở Việt Nam đã diễn ra ra sao sau 30 năm cải cách kinh tế?"
        ]
    },
    {
        "data": 1817,
        "questions": [
            "1. Vua Gia Long đã có vai trò gì trong quá trình thống nhất lãnh thổ Việt Nam vào thế kỷ XIX?",
            "2. Những chính sách nào mà Gia Long ban hành trong 3 tháng ở Thăng Long?",
            "3. Gia Long đã áp dụng chính sách hòa giải như thế nào với các quan lại thời Trịnh và Lê?",
            "4. Tại sao sự hiện diện của vua Gia Long tại Thăng Long được coi là quan trọng trong lịch sử Việt Nam?",
            "5. Hình thức tổ chức lễ nghi và sự đối xử của Gia Long với các tộc người khác có ý nghĩa gì đối với xã hội đa dân tộc lúc bấy giờ?"
        ]
    },
    {
        "data": 296,
        "questions": [
            "1. Ai là người họa sĩ vẽ chân dung Bác Hồ ở Việt Bắc và năm nào diễn ra sự kiện này?",
            "2. Phan Kế An đã có những trải nghiệm nào trong thời kỳ kháng chiến chống thực dân Pháp?",
            "3. Tác phẩm nào của Phan Kế An được chọn để in trên phụ bản báo Sự Thật?",
            "4. Tại sao Phan Kế An quyết định theo đuổi nghệ thuật thay vì tiếp tục truyền thống gia đình làm quan?",
            "5. Những ảnh hưởng nào từ Bác Hồ đã giúp Phan Kế An trong sự nghiệp nghệ thuật của ông?"
        ]
    },
    {
        "data": 1843,
        "questions": [
            "1. Những điểm đặc sắc nào được nhấn mạnh trong bộ ảnh về đền và chùa Hà Nội xưa?",
            "2. Ai là người sưu tầm bộ ảnh lịch sử này và có ý nghĩa gì đối với Hà Nội?",
            "3. Các chuyên đề về Hà Nội được nêu trong đoạn văn có sự liên kết nào với nhau không?",
            "4. Đền và chùa nào nổi bật nhất trong bộ ảnh và vì sao?",
            "5. Tại sao bộ ảnh này lại được chọn giới thiệu trong dịp Đại lễ kỷ niệm 1.000 năm Thăng Long?"
        ]
    },
    {
        "data": 1298,
        "questions": [
            "1. Ai là những nhân vật chủ chốt trong việc thành lập Đông Kinh nghĩa thục?",
            "2. Mục đích chính của Đông Kinh nghĩa thục là gì và nó ảnh hưởng như thế nào đến phong trào Duy Tân?",
            "3. Những loại môn học nào được giảng dạy tại Đông Kinh nghĩa thục và chúng có gì đặc biệt?",
            "4. Tại sao chính quyền thực dân lại cảm thấy lo ngại về phong trào Đông Kinh nghĩa thục?",
            "5. Đông Kinh nghĩa thục đã truyền bá những giá trị nào đến thế hệ thanh niên Việt Nam thời đó?"
        ]
    },
    {
        "data": 906,
        "questions": [
            "1. Ai là thân phụ của Vua Lý Thần Tông và nổi tiếng với điều gì?",
            "2. Lý do nào khiến Vua Lý Thần Tông được cho là có nguồn gốc đặc biệt?",
            "3. Thiền sư nào đã chữa bệnh cho Vua Lý Thần Tông và phương pháp điều trị của ông ra sao?",
            "4. Có những vật gì mà Vua Lý Thần Tông coi là điềm lành?",
            "5. Nguyên nhân nào dẫn đến việc các học sĩ, nhà sư và đạo sĩ đoán chữ trên mai rùa?"
        ]
    },
    {
        "data": 892,
        "questions": [
            "1. Bảo tàng Louvre có diện tích tổng cộng là bao nhiêu m² và diện tích dành riêng cho trưng bày là bao nhiêu?",
            "2. Ai là vua đã xây dựng pháo đài Louvre ban đầu và vào năm nào?",
            "3. Các triều đại nào đã sống và làm việc tại bảo tàng Louvre?",
            "4. Tranh Mona Lisa của Leonardo da Vinci đã từng bị đánh cắp trong bao lâu?",
            "5. Kim tự tháp kính của Louvre có ý nghĩa gì và ai là người đề xuất xây dựng nó?"
        ]
    },
    {
        "data": 1697,
        "questions": [
            "1. Ai là những nhà khoa bảng nổi bật trong năm Tân Mão 1651?",
            "2. Nguyễn Đăng Đạo có ảnh hưởng gì đến văn hóa Việt Nam thời bấy giờ?",
            "3. Các nhà khoa bảng của năm Tân Mão có điểm gì chung trong sự nghiệp của họ?",
            "4. Thông tin nào nổi bật về Phạm Điển trong năm Tân Mão 1531?",
            "5. Năm Tân Mão 1891, Nguyễn Trọng Tĩnh đạt được thành tựu gì trong sự nghiệp học vấn?"
        ]
    },
    {
        "data": 1876,
        "questions": [
            "1. Thăng Long được xây dựng và củng cố như thế nào dưới triều đại nhà Trần?",
            "2. Vai trò của Thái sư Trần Thủ Độ trong cuộc kháng chiến chống quân Mông - Nguyên là gì?",
            "3. Các cổng thành và cấu trúc của Thăng Long có đặc điểm gì nổi bật trong thời kỳ nhà Trần?",
            "4. Khoa thi Thái học sinh đã ảnh hưởng như thế nào đến nền giáo dục dưới triều Trần?",
            "5. Những đóng góp nổi bật của triều đại nhà Trần trong việc bảo vệ chủ quyền đất nước là gì?"
        ]
    },
    {
        "data": 581,
        "questions": [
            "1. Dân công đã đóng góp vai trò gì trong chiến dịch Điện Biên Phủ?",
            "2. Những khó khăn lớn nhất mà Đảng, Nhà nước và nhân dân phải đối mặt trong chiến dịch này là gì?",
            "3. Sức mạnh nào giúp dân công vượt qua những khó khăn trong việc cung cấp lương thực, vũ khí?",
            "4. Các phương tiện vận chuyển nào được sử dụng để đảm bảo tiếp tế cho chiến dịch Điện Biên Phủ?",
            "5. Tại sao đường tiếp tế cho quân đội nhân dân không bao giờ bị cắt đứt trong suốt chiến dịch?"
        ]
    },
    {
        "data": 1552,
        "questions": [
            "1. Khu lăng miếu Triệu Tường nằm ở đâu và có diện tích bao nhiêu m²?",
            "2. Ai là người xây dựng khu lăng miếu Triệu Tường và vào năm nào?",
            "3. Những vị nào được thờ trong khu miếu này và tại sao họ lại quan trọng?",
            "4. Khu vực Nguyên miếu có đặc điểm kiến trúc và trang trí như thế nào?",
            "5. Lý do nào khiến lăng miếu Triệu Tường được coi là \"kinh thành Huế thu nhỏ\"?"
        ]
    },
    {
        "data": 1195,
        "questions": [
            "1. Vua Trần Nhân Tông đã tiếp đãi sứ giả nhà Nguyên như thế nào để khẳng định bản lĩnh dân tộc?",
            "2. Trương Hiển Khanh có vai trò gì trong sứ mệnh của ông đến Việt Nam?",
            "3. Tại sao cuộc gặp giữa vua Trần và Trương Hiển Khanh lại mang tính chất đấu tranh ngoại giao?",
            "4. Ý nghĩa của việc biếu mâm bánh và bài thơ trong ngữ cảnh văn hóa Việt Nam là gì?",
            "5. Vua Trần Nhân Tông dựa vào những căn cứ nào để khẳng định Tết mồng ba tháng ba là \"phong tục cổ của An Nam\"?"
        ]
    },
    {
        "data": 1694,
        "questions": [
            "1. Ai là những nhà khoa bảng nổi bật sinh năm Đinh Mão và các thông tin quan trọng về họ?",
            "2. Những thành tựu nổi bật của Nguyễn Tắc Dĩnh trong sự nghiệp quan trường là gì?",
            "3. Hoàng Công Đảng đã đạt được vị trí nào trong triều đình và xuất phát từ khoa nào?",
            "4. Các nhà khoa bảng sinh năm Đinh Mão có ảnh hưởng gì đến lịch sử văn hóa Việt Nam?",
            "5. Những đóng góp và thành tựu nào của Nguyễn Đình Trụ trong sự nghiệp của ông?"
        ]
    },
    {
        "data": 1594,
        "questions": [
            "1. Lạc Dương có vai trò gì trong sự phát triển của Đạo giáo tại Trung Quốc?",
            "2. Những di sản gì đã được công nhận tại Lạc Dương?",
            "3. Long Môn Động nổi bật với điều gì trong lịch sử nghệ thuật điêu khắc?",
            "4. Bạch Mã Tự đã trải qua những thay đổi nào qua các thời kỳ lịch sử?",
            "5. Lạc Dương Mẫu đơn hội diễn ra vào thời gian nào và thu hút những đối tượng nào?"
        ]
    },
    {
        "data": 1233,
        "questions": [
            "1. Vua Minh Mệnh tên thật là gì và ông là con thứ mấy của vua Gia Long?",
            "2. Ngày nào vua Minh Mệnh chính thức lên ngôi Hoàng đế?",
            "3. Nội dung chính của bản chiếu lên ngôi của vua Minh Mệnh là gì?",
            "4. Những chính sách thi ân nào được đề cập trong bản chiếu của vua Minh Mệnh?",
            "5. Bản chiếu lên ngôi của vua Minh Mệnh hiện đang được lưu giữ ở đâu?"
        ]
    },
    {
        "data": 20,
        "questions": [
            "1. Tuyên ngôn độc lập được đọc vào ngày nào và ai là người thực hiện việc này?",
            "2. Văn kiện Tuyên ngôn độc lập khẳng định điều gì về quyền lợi của dân tộc Việt Nam?",
            "3. Những giá trị văn hóa tiêu biểu nào của dân tộc Việt Nam được thể hiện trong Tuyên ngôn độc lập?",
            "4. Vì sao tinh thần yêu nước lại được coi là nguồn sức mạnh trong cuộc đấu tranh giành độc lập của dân tộc Việt Nam?",
            "5. Tuyên ngôn độc lập đã nhấn mạnh điều gì về thái độ của dân tộc Việt Nam đối với nước Pháp?"
        ]
    },
    {
        "data": 1915,
        "questions": [
            "1. Ngô Nhật Khánh là ai và vai trò của ông trong cuộc loạn mười hai sứ quân ra sao?",
            "2. Tại sao Ngô Nhật Khánh lại không chấp nhận mối quan hệ với triều đình Đinh Tiên Hoàng?",
            "3. Sự kiện nào dẫn đến cái chết bi thảm của Ngô Nhật Khánh?",
            "4. Mối quan hệ giữa Ngô Nhật Khánh và Ngô Quyền có ảnh hưởng gì đến hành động của ông?",
            "5. Tại sao sự chống đối triều đình Đinh Tiên Hoàng lại được coi là tội nặng trong bối cảnh lúc bấy giờ?"
        ]
    },
    {
        "data": 1955,
        "questions": [
            "1. Ai là người đầu tiên nhắc đến lục địa Atlantis trong văn học và vào thời điểm nào?",
            "2. Những giả thuyết chính nào có thể giải thích cho sự biến mất của Atlantis?",
            "3. Có những nhân tố nào khiến cho các nhà nghiên cứu vẫn tin vào sự tồn tại của Atlantis?",
            "4. Tại sao Plato chọn mô tả Atlantis như một nền văn minh tiên tiến trong tác phẩm của mình?",
            "5. Những nguồn tài liệu nào cung cấp thông tin về Atlantis và tính chính xác của chúng ra sao?"
        ]
    },
    {
        "data": 1754,
        "questions": [
            "1. Công trình nào được coi là nhà thờ lớn nhất thế giới và ai là kiến trúc sư nổi tiếng chịu trách nhiệm thiết kế nó?",
            "2. Nhà thờ Sagrada Familia bắt đầu xây dựng vào năm nào và nguyên nhân tại sao nó vẫn chưa hoàn thành?",
            "3. Những đặc điểm nổi bật nào khiến nhà thờ Đức Bà Paris trở thành công trình nghệ thuật tôn giáo nổi tiếng nhất châu Âu?",
            "4. So sánh giữa nhà thờ St. Peter ở Vatican và nhà thờ Voto Nacional ở Quito về thời gian xây dựng và phong cách kiến trúc.",
            "5. Ai là người thiết kế nhà thờ quốc gia Washington, và quá trình xây dựng của nó kéo dài bao lâu?"
        ]
    },
    {
        "data": 1130,
        "questions": [
            "1. Ai là nhân vật lịch sử gắn liền với đền Voi Phục và có công dẹp giặc?",
            "2. Đền Linh Lang tọa lạc ở đâu trong Hà Nội hiện nay?",
            "3. Tại sao Linh Lang Đại vương được phong thần và lập đền thờ?",
            "4. Ý nghĩa của tên gọi \"Linh Lang từ\" trong ngữ cảnh lịch sử?",
            "5. Linh Lang có mối liên hệ gì với các nhân vật khác trong lịch sử Việt Nam?"
        ]
    },
    {
        "data": 1981,
        "questions": [
            "1. Những đồ vật nào được tìm thấy trong mộ vua Lê Dụ Tông liên quan đến ngành vải sợi?",
            "2. Ai là người đã ghi chép lại sự kiện đám tang của vua Lê Dụ Tông?",
            "3. Mộ vua Lê Dụ Tông được xây dựng với những chất liệu gì đặc biệt?",
            "4. Tại sao việc khai quật mộ vua Lê Dụ Tông lại quan trọng đối với nghiên cứu lịch sử?",
            "5. Những lớp vải và trang phục nào đã được sử dụng để liệm thi hài vua Lê Dụ Tông?"
        ]
    },
    {
        "data": 1749,
        "questions": [
            "1. Những điều kiện nào đã giúp bảo tồn các xác ướp trong đầm lầy ở Châu Âu?",
            "2. Ai là cô gái Yde và có gì đặc biệt về xác ướp của cô?",
            "3. Tại sao xác chết của người phụ nữ Huldremose lại gây khó khăn cho các nhà nghiên cứu trong việc xác định nguyên nhân cái chết?",
            "4. Những phát hiện nào đã được thực hiện về xác ướp của người đàn ông Weerdinge khi nghiên cứu tiếp tục diễn ra?",
            "5. Các nhà khoa học đã tìm ra thông tin gì mới về xác ướp của người phụ nữ Haraldskær trong cuộc kiểm tra năm 2000?"
        ]
    },
    {
        "data": 1204,
        "questions": [
            "1. Đền Artemis được xây dựng để tôn vinh nữ thần nào của Hy Lạp?",
            "2. Quá trình xây dựng và hoàn thành của đền Artemis kéo dài trong bao lâu?",
            "3. Những nghệ sỹ nổi tiếng nào đã tạo ra các tác phẩm điêu khắc bên trong đền Artemis?",
            "4. Đền Artemis thuộc thành phố nào của Thổ Nhĩ Kỳ hiện nay?",
            "5. Tại sao đền Artemis lại được xem là một trong Bảy kỳ quan tráng lệ nhất thế giới?"
        ]
    },
    {
        "data": 834,
        "questions": [
            "1. Di sản nào mà nhà Hồ để lại cho hậu thế?",
            "2. Ai là người chủ trì xây dựng thành nhà Hồ?",
            "3. Tại sao thành nhà Hồ lại được tổ chức UNESCO công nhận là di sản nhân loại?",
            "4. Những đặc điểm nổi bật nào khiến thành nhà Hồ trở nên độc đáo trong kiến trúc?",
            "5. Tại sao vua Hồ Quý Ly không sử dụng họ của mình để đặt tên cho thành?"
        ]
    },
    {
        "data": 1014,
        "questions": [
            "1. Ai là người lãnh đạo quân đội trong các trận đánh chống lại nhà Tống ở Đại Việt?",
            "2. Những địa danh nào liên quan đến các trận đánh lịch sử oai hùng của dân tộc Việt Nam?",
            "3. Vua Lê Thánh Tông đã lưu ý điều gì về việc bảo vệ lãnh thổ nước Việt?",
            "4. Tại sao nhân dân Đại Việt lại coi trọng tinh thần đoàn kết trong chiến tranh chống xâm lược?",
            "5. Kết quả của các chiến thắng chống quân Tống có ảnh hưởng như thế nào đến vị thế của Đại Việt trong khu vực?"
        ]
    }
]